#include "info.h"

//---------------------------------------------------------------------------

ROM_DATA char InfoStrMes[][14+1] = {
	"ＭＥＳ",
	"正士",
	"戒田",
	"雨音",
	"悠夏",
	"藍",
	"明日菜",
	"文乃",
	"斉臥",
	"英里子",
	"堂島",
	"辻夫",
	"宗介",
	"黒服",
	"堀田",
	"スキンヘッド",
	"仏ぼくろ",
	"紫シャツ",
	"チンピラ",
	"サングラス",
	"？？？",
	"男の声",
	"アナウンサー",
	"真紀",
	"郵便屋さん",
	"ＯＤＷ",
	"清美",
	"一同",
	"若い警官",
	"青年会の人",
	"おじさん",
	"おばさん",
	"眼鏡記者",
	"売店のおばさん",
	"お爺さん",
	"村の青年",
	"村の中年",
	"狛猫",
	"駅員",
	"駅長",
	"ごろつき",
	"金髪ゴリラ",
};

ROM_DATA char InfoStrNavi[][40] = {
	"21212111212122121",						// 17 雨音
	"211221222121211112121121221312211211113",	// 39 悠夏
	"2211112122212231112132122233132",			// 32 藍
	"121111222215123245",						// 18 明日菜
	"1211112211211112212342321122213",			// 31 文乃
};
//---------------------------------------------------------------------------
void InfoInit(void)
{
	// EMPTY
}
//---------------------------------------------------------------------------
char* InfoGetStrMes(s32 idx)
{
	_ASSERT(idx < INFO_MAX_MES_CNT);

	return InfoStrMes[idx];
}
//---------------------------------------------------------------------------
s32 InfoGetNavi(s32 i, s32 c)
{
	_ASSERT(i < 5);
	_ASSERT(c < 40);

	return InfoStrNavi[i][c] - '1';
}
//---------------------------------------------------------------------------
s32 InfoGetBg(s32 idx, s32 mov)
{
	return InfoGetIdxClmp(idx, mov, INFO_MAX_BG_CNT);
}
//---------------------------------------------------------------------------
s32 InfoGetChr(s32 idx, s32 mov)
{
	return InfoGetIdxClmp(idx, mov, INFO_MAX_CHR_CNT);
}
//---------------------------------------------------------------------------
s32 InfoGetMus(s32 idx, s32 mov)
{
	return InfoGetIdxClmp(idx, mov, INFO_MAX_MUS_CNT);
}
//---------------------------------------------------------------------------
s32 InfoGetSnd(s32 idx, s32 mov)
{
	return InfoGetIdxClmp(idx, mov, INFO_MAX_SND_CNT);
}
//---------------------------------------------------------------------------
s32 InfoGetTxt(s32 idx, s32 mov)
{
	return InfoGetIdxClmp(idx, mov, INFO_MAX_TXT_CNT);
}
//---------------------------------------------------------------------------
s32 InfoGetIdxClmp(s32 idx, s32 mov, s32 max)
{
	idx += mov;

	if(idx < 0)
	{
		idx = 0;
	}

	if(idx >= max)
	{
		idx = max - 1;
	}

	return idx;
}
//---------------------------------------------------------------------------
s32 InfoGetIdxLoop(s32 idx, s32 mov, s32 max)
{
	idx += mov;

	if(idx < 0)
	{
		idx = max - 1;
	}

	if(idx >= max)
	{
		idx = 0;
	}

	return idx;
}
