#include "info.h"


//---------------------------------------------------------------------------
char InfoStr[][24+1] = {
	"はじめ　タイトル　　　　" ,		// 0
	"はじめ　あきら紹介　　　" ,
	"はじめ　ファミレス　　　" ,
	"はじめ　ボス登場　　　　" ,
	"はじめ　捕まる　　　　　" ,
	"はじめ　牢屋　　　　　　" ,		// 5
	"はじめ　看守　　　　　　" ,
	"はじめ　逃げる　　　　　" ,
	"分岐１　選択　　　　　　" ,
	"分岐１　左へサキ捕まる　" ,
	"分岐１　右へ手下Ａ　　　" ,		// 10
	"分岐１　バトル　　　　　" ,
	"分岐１　負け　　　　　　" ,
	"分岐２　選択　　　　　　" ,
	"分岐２　左へ手下Ｂ　　　" ,
	"分岐２　右へかりん捕まる" ,		// 15
	"分岐２　バトル　　　　　" ,
	"分岐２　負け　　　　　　" ,
	"ＥＤ１　逃げ失敗　　　　" ,
	"ＥＤ２　負け　　　　　　" ,
	"ＥＤ３　負け１　　　　　" ,		// 20
	"ＥＤ３　負け２　　　　　" ,
	"ボス１　会話　　　　　　" ,
	"ボス２　かりんＨ　　　　" ,
	"ボス２　サキＨ　　　　　" ,
	"ボス２　会話　　　　　　" ,		// 25
	"ボス３　サキＨ　　　　　" ,
	"ボス３　サキ倒れる　　　" ,
	"ボス４　バトル　　　　　" ,
	"ＥＤ４　勝ち二人いる１　" ,
	"ＥＤ４　勝ち二人いる２　" ,		// 30
	"ＥＤ４　勝ち二人いる３　" ,
	"ＥＤ４　勝ち二人いる４　" ,
	"ＥＤ４　勝ち二人いる５　" ,
	"ＥＤ４　勝ち二人いる６　" ,
	"ＥＤ５　勝ちサキいない　" ,		// 35
	"ＥＤ６　勝ち二人いない１" ,
	"ＥＤ６　勝ち二人いない２" ,
	"ＥＤ６　勝ち二人いない３" ,
	"ＥＤ６　勝ち二人いない４" ,
	"ＥＤ６　勝ち二人いない５" ,		// 40
	"ＥＤ６　勝ち二人いない６" ,
	"ＥＤ６　勝ち二人いない７" ,
	"ＥＤ６　勝ち二人いない８" ,
	"ＥＤ７　負け二人いる１　" ,
	"ＥＤ７　負け二人いる２　" ,		// 45
	"ＥＤ７　負け二人いる３　" ,
	"ＥＤ７　負け二人いる４　" ,
	"ＥＤ７　負け二人いる５　" ,
	"ＥＤ７　負け二人いる６　" ,
	"ＥＤ８　負け１　　　　　" ,		// 50
	"ＥＤ８　負け２　　　　　" ,
	"ＥＤ８　負け３　　　　　" ,
	"ＥＤ８　負け４　　　　　" ,
};

//---------------------------------------------------------------------------
char InfoFile[][4+1] = {
	"MAIN",
	"RI00",
};

//---------------------------------------------------------------------------
EWRAM_CODE void InfoInit(void)
{
	// EMPTY
}
//---------------------------------------------------------------------------
EWRAM_CODE s32 InfoGetPrev(s32 idx)
{
	idx--;

	if(idx < 0)
	{
		idx = 0;
	}

	return idx;
}
//---------------------------------------------------------------------------
EWRAM_CODE s32 InfoGetPrev2(s32 idx)
{
	idx -= 10;

	if(idx < 1)
	{
		idx = 1;
	}

	return idx;
}
//---------------------------------------------------------------------------
EWRAM_CODE s32 InfoGetNext(s32 idx)
{
	idx++;

	if(idx >= INFO_MAX_LIST_CNT)
	{
		idx = INFO_MAX_LIST_CNT - 1;
	}

	return idx;
}
//---------------------------------------------------------------------------
EWRAM_CODE s32 InfoGetNext2(s32 idx)
{
	idx += 10;

	if(idx >= INFO_MAX_LIST_CNT)
	{
		idx = INFO_MAX_LIST_CNT - 1;
	}

	return idx;
}
//---------------------------------------------------------------------------
EWRAM_CODE char* InfoGetTxt(s32 idx)
{
	return InfoStr[idx];
}
//---------------------------------------------------------------------------
EWRAM_CODE char* InfoGetFile(s32 idx)
{
	return (idx == 0) ? InfoFile[0] : InfoFile[1];
}
